{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "#": 1,
      "(": 2,
      ")": 3,
      "+": 4,
      "-": 5,
      "/": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "=": 12,
      "@": 13,
      "C": 14,
      "F": 15,
      "H": 16,
      "N": 17,
      "O": 18,
      "[": 19,
      "\\": 20,
      "]": 21,
      "c": 22,
      "n": 23,
      "o": 24,
      "CC": 25,
      "C1": 26,
      "CC1": 27,
      "O)": 28,
      "(C": 29,
      "C2": 30,
      "CO": 31,
      "[N": 32,
      "c1": 33,
      "[NH": 34,
      "(C)": 35,
      "=O)": 36,
      "C(": 37,
      "+]": 38,
      "CC2": 39,
      "C#": 40,
      "CC12": 41,
      "C3": 42,
      "CC(": 43,
      "C12": 44,
      "[NH+]": 45,
      "C=": 46,
      "O=": 47,
      "N)": 48,
      "cc": 49,
      "CCC1": 50,
      "C(=O)": 51,
      "CN": 52,
      "OC1": 53,
      "-]": 54,
      "(O)": 55,
      "H]": 56,
      "[n": 57,
      "=O": 58,
      "[NH-]": 59,
      "C(C)": 60,
      "[nH]": 61,
      "C[NH+]": 62,
      "n1": 63,
      "N#": 64,
      "nc": 65,
      "CC3": 66,
      "CC1C2": 67,
      "CC(=O)": 68,
      "Cc1": 69,
      "C1O": 70,
      "O1": 71,
      "CC1O": 72,
      "C(O)": 73,
      "COC1": 74,
      "CC(C)": 75,
      "(C#": 76,
      "CC(O)": 77,
      "O=C1": 78,
      "(C=O)": 79,
      "C=O": 80,
      "H+]": 81,
      "CC#": 82,
      "(C#N)": 83,
      "(CO)": 84,
      "2+]": 85,
      "[NH2+]": 86,
      "CCO": 87,
      "[C": 88,
      "C#CC1": 89,
      "C[NH+]1": 90,
      "NC1": 91,
      "CO1": 92,
      "[CH+]": 93,
      "C21": 94,
      "N1": 95,
      "CC1=": 96,
      "CN1": 97,
      "c1c": 98,
      "CC1(C)": 99,
      "C32": 100,
      "[NH+]1": 101,
      "CCC2": 102,
      "C1=": 103,
      "C#N": 104,
      "C1C2": 105,
      "[NH-])": 106,
      "c(": 107,
      "c1cc": 108,
      "CCC12": 109,
      "CC1(O)": 110,
      "2)": 111,
      "C4": 112,
      "OC12": 113,
      "nn": 114,
      "C1)": 115,
      "C2C3": 116,
      "c2": 117,
      "CC1CC2": 118,
      "C#CC": 119,
      "CC=": 120,
      "F)": 121,
      "N=": 122,
      "o1": 123,
      "NC(=O)": 124,
      "C([NH-])": 125,
      "C1CC2": 126,
      "(N)": 127,
      "C2O": 128,
      "C(N)": 129,
      "[nH]1": 130,
      "[NH+]2": 131,
      "(C2": 132,
      "C)": 133,
      "nc1": 134,
      "C/": 135,
      "NC2": 136,
      "CC21": 137,
      "Cc1c": 138,
      "ncc": 139,
      "Cc1cc": 140,
      "CC2)": 141,
      "NC12": 142,
      "N2": 143,
      "N#CC1": 144,
      "COC2": 145,
      "OC2": 146,
      "C[NH+]2": 147,
      "C1(C)": 148,
      "c1nc": 149,
      "C[NH2+]": 150,
      "C1CC1": 151,
      "C(CO)": 152,
      "C(C#N)": 153,
      "C#CC12": 154,
      "COC12": 155,
      "OC3": 156,
      "O2": 157,
      "C1OC2": 158,
      "no": 159,
      "C1=O": 160,
      "CO2": 161,
      "n[nH]": 162,
      "C13": 163,
      "CCOC1": 164,
      "(F)": 165,
      "C(C=O)": 166,
      "/N=": 167,
      "c1N": 168,
      "CC12CC3": 169,
      "CC1CC": 170,
      "[H]": 171,
      "C=CC2": 172,
      "C1=CC2": 173,
      "c1O": 174,
      "CC12C3": 175,
      "[NH+]3": 176,
      "(CC": 177,
      "CC1OC2": 178,
      "O1)": 179,
      "[H]/N=": 180,
      "nc2": 181,
      "C=CC": 182,
      "c(=O)": 183,
      "CC(O)C1": 184,
      "CC(=O)C1": 185,
      "Cn1": 186,
      "C(N)=O": 187,
      "OC": 188,
      "CC12CC": 189,
      "C[NH+]3": 190,
      "=N": 191,
      "C(=O)C1": 192,
      "OCC1": 193,
      "CC#N": 194,
      "OC1C2": 195,
      "(C1)": 196,
      "(=O)": 197,
      "CCCC1": 198,
      "O=C1CC2": 199,
      "CCC(C)": 200,
      "C(O)C1": 201,
      "CC1=CC2": 202,
      "CCO1": 203,
      "CC12O": 204,
      "nn1": 205,
      "CC=O": 206,
      "C3C1": 207,
      "CCC1C2": 208,
      "N#CC": 209,
      "CC1C2C3": 210,
      "C(C": 211,
      "C1CO1": 212,
      "C[NH+]1C2": 213,
      "CC2O": 214,
      "[NH-]C1": 215,
      "Cc1nc": 216,
      "[nH]c": 217,
      "c(N)": 218,
      "[nH+]": 219,
      "CC(N)": 220,
      "[CH+][NH2+]": 221,
      "H-]": 222,
      "CC12CC1": 223,
      "Nc1": 224,
      "Nc1c": 225,
      "C(C1)": 226,
      "C#CC(C)": 227,
      "C(O)C2": 228,
      "O=CC1": 229,
      "[CH-]": 230,
      "3)": 231,
      "CCC(=O)": 232,
      "c1=O": 233,
      "CC(C1)": 234,
      "CN2": 235,
      "CC1CO": 236,
      "[NH-]C1O": 237,
      "oc": 238,
      "CC(C": 239,
      "CNC(=O)": 240,
      "CCC1O": 241,
      "CC1C": 242,
      "CCC1(C)": 243,
      "Nc1cc": 244,
      "n2": 245,
      "CC[NH+]1": 246,
      "c1C": 247,
      "CC(C#N)": 248,
      "C(C)C1": 249
    },
    "merges": [
      "C C",
      "C 1",
      "CC 1",
      "O )",
      "( C",
      "C 2",
      "C O",
      "[ N",
      "c 1",
      "[N H",
      "(C )",
      "= O)",
      "C (",
      "+ ]",
      "CC 2",
      "C #",
      "CC1 2",
      "C 3",
      "CC (",
      "C1 2",
      "[NH +]",
      "C =",
      "O =",
      "N )",
      "c c",
      "CC C1",
      "C( =O)",
      "C N",
      "O C1",
      "- ]",
      "( O)",
      "H ]",
      "[ n",
      "= O",
      "[NH -]",
      "C (C)",
      "[n H]",
      "C [NH+]",
      "n 1",
      "N #",
      "n c",
      "CC 3",
      "CC1 C2",
      "CC( =O)",
      "C c1",
      "C1 O",
      "O 1",
      "CC1 O",
      "C( O)",
      "CO C1",
      "CC (C)",
      "(C #",
      "CC( O)",
      "O= C1",
      "(C =O)",
      "C= O",
      "H +]",
      "CC #",
      "(C# N)",
      "(C O)",
      "2 +]",
      "[NH 2+]",
      "CC O",
      "[ C",
      "C# CC1",
      "C[NH+] 1",
      "N C1",
      "CO 1",
      "[C H+]",
      "C2 1",
      "N 1",
      "CC1 =",
      "CN 1",
      "c1 c",
      "CC1 (C)",
      "C3 2",
      "[NH+] 1",
      "CC C2",
      "C1 =",
      "C# N",
      "C1 C2",
      "[NH-] )",
      "c (",
      "c1 cc",
      "CC C12",
      "CC1 (O)",
      "2 )",
      "C 4",
      "O C12",
      "n n",
      "C1 )",
      "C2 C3",
      "c 2",
      "CC1 CC2",
      "C# CC",
      "CC =",
      "F )",
      "N =",
      "o 1",
      "N C(=O)",
      "C( [NH-])",
      "C1 CC2",
      "( N)",
      "C2 O",
      "C( N)",
      "[nH] 1",
      "[NH+] 2",
      "(C 2",
      "C )",
      "n c1",
      "C /",
      "N C2",
      "CC2 1",
      "Cc1 c",
      "n cc",
      "Cc1 cc",
      "CC2 )",
      "N C12",
      "N 2",
      "N# CC1",
      "CO C2",
      "O C2",
      "C[NH+] 2",
      "C1 (C)",
      "c1 nc",
      "C [NH2+]",
      "C1 CC1",
      "C (CO)",
      "C (C#N)",
      "C# CC12",
      "CO C12",
      "O C3",
      "O 2",
      "C1O C2",
      "n o",
      "C1 =O",
      "CO 2",
      "n [nH]",
      "C1 3",
      "CC OC1",
      "( F)",
      "C (C=O)",
      "/ N=",
      "c1 N",
      "CC12 CC3",
      "CC1 CC",
      "[ H]",
      "C= CC2",
      "C1= CC2",
      "c1 O",
      "CC12 C3",
      "[NH+] 3",
      "( CC",
      "CC1O C2",
      "O1 )",
      "[H] /N=",
      "nc 2",
      "C= CC",
      "c( =O)",
      "CC(O) C1",
      "CC(=O) C1",
      "C n1",
      "C(N) =O",
      "O C",
      "CC12 CC",
      "C[NH+] 3",
      "= N",
      "C(=O) C1",
      "O CC1",
      "CC# N",
      "OC1 C2",
      "( C1)",
      "( =O)",
      "CC CC1",
      "O=C1 CC2",
      "CC C(C)",
      "C(O) C1",
      "CC1= CC2",
      "CC O1",
      "CC12 O",
      "n n1",
      "CC =O",
      "C3 C1",
      "CCC1 C2",
      "N# CC",
      "CC1C2 C3",
      "C (C",
      "C1 CO1",
      "C[NH+]1 C2",
      "CC2 O",
      "[NH-] C1",
      "Cc1 nc",
      "[nH] c",
      "c( N)",
      "[n H+]",
      "CC( N)",
      "[CH+] [NH2+]",
      "H -]",
      "CC12 CC1",
      "N c1",
      "N c1c",
      "C( C1)",
      "C# CC(C)",
      "C(O) C2",
      "O= CC1",
      "[C H-]",
      "3 )",
      "CC C(=O)",
      "c1 =O",
      "CC( C1)",
      "CN 2",
      "CC1 CO",
      "[NH-] C1O",
      "o c",
      "CC (C",
      "CN C(=O)",
      "CCC1 O",
      "CC1 C",
      "CCC1 (C)",
      "N c1cc",
      "n 2",
      "CC [NH+]1",
      "c1 C",
      "CC (C#N)",
      "C(C) C1"
    ]
  }
}